In [2]:
import numpy as np
import pandas as pd
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [6]:
pd.Series(data=my_data,index=labels) #index change to labels value

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
[sum,print,len]

[<function sum(iterable, /, start=0)>,
 <function print(*args, sep=' ', end='\n', file=None, flush=False)>,
 <function len(obj, /)>]

In [14]:
ser1=pd.Series([1,2,3,4,5],['USA','Germany','USSR','India','Japan'])
ser2=pd.Series([1,2,6,4],['USA','Italy','Germany','India'])
ser1['India']

4

In [16]:
ser1+ser2

Germany    8.0
India      8.0
Italy      NaN
Japan      NaN
USA        2.0
USSR       NaN
dtype: float64

In [22]:
np.random.randn(5,4)

array([[-0.45802699,  0.43516349, -0.58359505,  0.81684707],
       [ 0.67272081, -0.10441114, -0.53128038,  1.02973269],
       [-0.43813562, -1.11831825,  1.61898166,  1.54160517],
       [-0.25187914, -0.84243574,  0.18451869,  0.9370822 ],
       [ 0.73100034,  1.36155613, -0.32623806,  0.05567601]])

In [24]:
np.random.seed(100)
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])#data here 2d 0 uniform disutribution of 5 row, 4 colmn, 2nd arg is index,3rd colmns
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [28]:
print(df['W']) #kind of series
print(df['W']['A'])
print(df[['W','Z']])

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64
-1.7497654730546974
          W         Z
A -1.749765 -0.252436
B  0.981321 -1.070043
C -0.189496  0.435163
D -0.583595 -0.104411
E -0.531280 -1.118318

In [30]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126
E -0.531280  1.029733 -0.438136 -1.118318 -0.969416

In [38]:
df.drop('new',axis=1,inplace=True) #axis=1 means column, 0 mean row, effect the df variable , remove from their too

In [40]:
#data frames similiar to numpy array 
df.shape #row is 0, colmn is 1 that why axis=0 is row

(5, 4)

In [42]:
df.loc['A'] #return colmns series

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [44]:
df.iloc[1] #index based location

W    0.981321
X    0.514219
Y    0.221180
Z   -1.070043
Name: B, dtype: float64

In [46]:
df.loc[['A','B'],['W','X']]

          W         X
A -1.749765  0.342680
B  0.981321  0.514219

In [48]:
df>0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [50]:
df[df>0] #NaN is null

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [52]:
df['W']>0

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [68]:
df[(df['Y']>0) & (df['X']>0)][['Y','X']] #and doesnt' work becuase df['W']>0 work on series of value not on single value

          Y         X
A  1.153036  0.342680
B  0.221180  0.514219
D  0.672721  0.816847

In [70]:
df[(df['Y']>0) | (df['X']>0)]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [90]:
df.reset_index(inplace=True) #youg get extra colmn , old index become column in data frame

In [106]:
df['index']

0    A
1    B
2    C
3    D
4    E
Name: index, dtype: object

In [112]:
new_index=['CA','DF','NY','WY','OR']
df['states']=new_index

In [116]:
df.set_index('states',inplace=True)

In [118]:
df

       index         W         X         Y         Z
states
CA         A -1.749765  0.342680  1.153036 -0.252436
DF         B  0.981321  0.514219  0.221180 -1.070043
NY         C -0.189496  0.255001 -0.458027  0.435163
WY         D -0.583595  0.816847  0.672721 -0.104411
OR         E -0.531280  1.029733 -0.438136 -1.118318

In [130]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index2=pd.MultiIndex.from_tuples(hier_index)
hier_index2

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [124]:
hier_index2

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [138]:
df1=pd.DataFrame(np.random.randn(6,2),hier_index2,['A','B'])#6*2 2d array, index is multi index, colmn is A,B

In [140]:
df1

             A         B
G1 1 -0.756352  0.816454
   2  0.750445 -0.455947
   3  1.189622 -1.690617
G2 1 -1.356399 -1.232435
   2 -0.544439 -0.668172
   3  0.007315 -0.612939

In [155]:
df1.loc['G1'].loc[1]

A   -0.756352
B    0.816454
Name: 1, dtype: float64

In [157]:
df1.index.names=['Groups','Num']

In [159]:
df1

                   A         B
Groups Num
G1     1   -0.756352  0.816454
       2    0.750445 -0.455947
       3    1.189622 -1.690617
G2     1   -1.356399 -1.232435
       2   -0.544439 -0.668172
       3    0.007315 -0.612939

In [161]:
df1.xs('G1') #cross section

            A         B
Num
1   -0.756352  0.816454
2    0.750445 -0.455947
3    1.189622 -1.690617

In [163]:
df1.xs(1,level='Num') # get 1 row of all groups , level is name of column

               A         B
Groups
G1     -0.756352  0.816454
G2     -1.356399 -1.232435

In [167]:
df2={'a':[1,2,np.nan],'b':[4,np.nan,np.nan],'c':[1,2,3]}
dfmissing=pd.DataFrame(df2)
dfmissing

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [177]:
dfmissing.dropna(axis=1,thresh=2) #remove row that has at least 1 null value, axis=1 means on column, thres =2, remove if at least 2 null value
dfmissing.dropna(axis=0,thresh=2)

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2

In [179]:
dfmissing.fillna(value='FILL') #fill null/missing value

      a     b  c
0   1.0   4.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [183]:
dfmissing['a'].fillna(value=dfmissing['a'].mean()) #fill nul value with mean value

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}